
## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Reading HTML, EXCEL, CSV tables and SQL Connection  as Pandas Dataframe </p>

In [1]:
Exploratory Data Analysis

SyntaxError: invalid syntax (3683572001.py, line 1)

# **Table of Contents**

1. [Import Library](#1)
1. [CSV Read](#2)
1. [CSV Output](#3)
1. [Excel Input](#4)

---
# ðŸ“¤ **Import Library** <a class="anchor" id="1"></a>
---

In [3]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings("ignore")
warnings.warn("this will not show")

---
# ðŸ’¾ **CSV Read** <a class="anchor" id="2"></a>
---

In [4]:
pd.read_csv("sample_comma.csv")

    name  age            job
0  Murat   25  data_scintist
1  Hande   28   data_analyst
2   Ezgi   23             Hr

In [9]:
pd.read_csv("sample_semicolon.csv") # Noktali virgÃ¼l ile ayrildigindan separator vermeliyiz.

             name;age;job
0  Murat;25;data_scintist
1   Hande;28;data_analyst
2              Ezgi;23;Hr

In [8]:
pd.read_csv("sample_semicolon.csv", sep=";")

    name  age            job
0  Murat   25  data_scintist
1  Hande   28   data_analyst
2   Ezgi   23             Hr

In [10]:
# Index 0,1,2,3 degilde name values'u indey yapalim.

pd.read_csv("sample_semicolon.csv", sep=";", index_col=0)

       age            job
name
Murat   25  data_scintist
Hande   28   data_analyst
Ezgi    23             Hr

In [13]:
pd.read_csv("sample_semicolon.csv", sep=";", nrows=2) #Column numarasi ile

    name  age            job
0  Murat   25  data_scintist
1  Hande   28   data_analyst

In [14]:
pd.read_csv("sample_semicolon.csv", sep=";", index_col="name") #Column name ile

       age            job
name
Murat   25  data_scintist
Hande   28   data_analyst
Ezgi    23             Hr

In [15]:
pd.read_csv("sample_tab.csv", sep="\t")

    name  age            job
0  Murat   25  data_scintist
1  Hande   28   data_analyst
2   Ezgi   23             Hr

In [17]:
pd.read_csv("sample_unwanted.csv") # First row contains repetition.

    name       age            job
0   name       age            job
1  Murat  yirmibes  data_scintist
2  Hande        28   data_analyst
3   Ezgi        23             Hr

In [20]:
pd.read_csv("sample_unwanted.csv", header=1) #Header row has not been deleted but first row has been accepted as header instead.

    name       age            job
0  Murat  yirmibes  data_scintist
1  Hande        28   data_analyst
2   Ezgi        23             Hr

In [21]:
# Let's remove yirmibes as it is not in line with other integer values.
pd.read_csv("sample_unwanted.csv", na_values="yirmibes")

    name  age            job
0   name  age            job
1  Murat  NaN  data_scintist
2  Hande   28   data_analyst
3   Ezgi   23             Hr

In [22]:
# Let's remove all non-integer values??


---
#  **CSV Output** <a class="anchor" id="3"></a>
---

In [23]:
df = pd.read_csv("sample_unwanted.csv", na_values="yirmibes", header=1)
df

    name   age            job
0  Murat   NaN  data_scintist
1  Hande  28.0   data_analyst
2   Ezgi  23.0             Hr

In [24]:
df.to_csv("final.csv") # Save as a new .csv file

In [25]:
pd.read_csv("final.csv")

   Unnamed: 0   name   age            job
0           0  Murat   NaN  data_scintist
1           1  Hande  28.0   data_analyst
2           2   Ezgi  23.0             Hr

In [28]:
df.to_csv("final.nonindex.csv", index = False) #Index'im olmasin diyoruz.

In [29]:
pd.read_csv("final.nonindex.csv")

    name   age            job
0  Murat   NaN  data_scintist
1  Hande  28.0   data_analyst
2   Ezgi  23.0             Hr

---
# ðŸ’¾ **Excel Input** <a class="anchor" id="4"></a>
---

In [31]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\user\anaconda3\lib\site-packages (3.0.10)
Requirement already satisfied: et_xmlfile in c:\users\user\anaconda3\lib\site-packages (from openpyxl) (1.1.0)

In [32]:
pd.read_excel("sample_excel_1.xlsx")

    a   b    c   d
0   1   8   15   3
1   2   9  227  11
2  32  52  125   5
3   4  15    3   1

In [39]:
df_excel_1 = pd.read_excel("sample_excel_1.xlsx", sheet_name="Sayfa1")

In [40]:
df_excel_2 = pd.read_excel("sample_excel_1.xlsx", sheet_name="Sayfa2") #Sheetname ile cagirmmak icin, normalde ilk sheet gelir.

In [36]:
pd.read_excel("sample_excel_1.xlsx", sheet_name="Sayfa2", header=1) #make first row header

   0   name  age            job
0  1  Murat   25  data_scintist
1  2  Hande   28   data_analyst
2  3   Ezgi   23             Hr

In [42]:
df_excel_dict = pd.read_excel("sample_excel_1.xlsx", sheet_name=None) #It will return the both sheets as dictionary.

In [43]:
type(df_excel_dict)

dict

In [44]:
df_excel_dict.keys()

dict_keys(['Sayfa1', 'Sayfa2'])

In [45]:
df_excel_dict.values()

dict_values([    a   b    c   d
0   1   8   15   3
1   2   9  227  11
2  32  52  125   5
3   4  15    3   1,    0 personal personal.1        general
0  0     name        age            job
1  1    Murat         25  data_scintist
2  2    Hande         28   data_analyst
3  3     Ezgi         23             Hr])

## Excel Output

In [46]:
df_excel_1.to_csv("sample_excel_to_csv_file.csv", index=False)

In [47]:
df_excel_1.to_excel("sample_excel_output.xlsx",index=False)

In [48]:
df_excel_1

    a   b    c   d
0   1   8   15   3
1   2   9  227  11
2  32  52  125   5
3   4  15    3   1

In [49]:
df_excel_2

   0 personal personal.1        general
0  0     name        age            job
1  1    Murat         25  data_scintist
2  2    Hande         28   data_analyst
3  3     Ezgi         23             Hr

In [50]:
with pd.ExcelWriter("Combined.xlsx") as writer:
    df_excel_1.to_excel(writer, sheet_name="garip_sayilar")
    df_excel_2.to_excel(writer, sheet_name="personel_bilgileri", index=False)

In [52]:
pd.read_excel("Combined.xlsx", sheet_name="garip_sayilar")

   Unnamed: 0   a   b    c   d
0           0   1   8   15   3
1           1   2   9  227  11
2           2  32  52  125   5
3           3   4  15    3   1

In [53]:
pd.read_excel("Combined.xlsx", sheet_name="personel_bilgileri")

   0 personal personal.1        general
0  0     name        age            job
1  1    Murat         25  data_scintist
2  2    Hande         28   data_analyst
3  3     Ezgi         23             Hr

## Read HTML

In [54]:
!pip install lxml
!pip install html5lib
!pip install BeautifulSoup4

Requirement already satisfied: lxml in c:\users\user\anaconda3\lib\site-packages (4.9.1)
Collecting html5lib
  Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
     -------------------------------------- 112.2/112.2 kB 2.2 MB/s eta 0:00:00
Requirement already satisfied: webencodings in c:\users\user\anaconda3\lib\site-packages (from html5lib) (0.5.1)
Requirement already satisfied: six>=1.9 in c:\users\user\anaconda3\lib\site-packages (from html5lib) (1.16.0)
Installing collected packages: html5lib
Successfully installed html5lib-1.1
Requirement already satisfied: BeautifulSoup4 in c:\users\user\anaconda3\lib\site-packages (4.11.1)
Requirement already satisfied: soupsieve>1.2 in c:\users\user\anaconda3\lib\site-packages (from BeautifulSoup4) (2.3.1)

https://hsgm.saglik.gov.tr/tr/haberler/yetkilendirilmis-covi-d-19-tani-laboratuvarlari.html

In [56]:
url = "https://hsgm.saglik.gov.tr/tr/haberler/yetkilendirilmis-covi-d-19-tani-laboratuvarlari.html"

In [58]:
df_covid = pd.read_html(url)
df_covid

[       0                      1                    2  \
 0     NO  YETKÄ°LENDÄ°RME GRUP NO                   Ä°L
 1      1                      1                ADANA
 2      2                      3                ADANA
 3      3                      5                ADANA
 4      4                      5                ADANA
 ..   ...                    ...                  ...
 519  519                      2            ZONGULDAK
 520  520                      5            ZONGULDAK
 521  521                      7  ZONGULDAK-K. EREÄžLÄ°
 522  522                      6  ZONGULDAK-K. EREÄžLÄ°
 523  523                      8  ZONGULDAK-K. EREÄžLÄ°

                                                      3
 0                                                KURUM
 1    ADANA Ä°L SAÄžLIK MÃœDÃœRLÃœÄžÃœ HALK SAÄžLIÄžI LABORAT...
 2                                ADANA ÅžEHÄ°R HASTANESÄ°
 3              Ã‡UKUROVA ÃœNÄ°VERSÄ°TESÄ° BALCALI HASTANESÄ°
 4                              SEYHAN DEVLET HASTANESÄ°
 ..                                                 ...
 519  ZONGULDAK BÃœLENT ECEVÄ°T ÃœNÄ°VERSÄ°TESÄ° TIP FAKÃœL...
 520                 ZONGULDAK ATATÃœRK DEVLET HASTANESÄ°
 521                  KARADENÄ°Z EREÄžLÄ° DEVLET HASTANESÄ°
 522            Ã–ZEL KARADENÄ°Z EREÄžLÄ° ECHOMAR HASTANESÄ°
 523                      Ã–ZEL EREÄžLÄ° ANADOLU HASTANESÄ°

 [524 rows x 4 columns]]

In [59]:
type(df_covid)

list

In [60]:
df_covid[0]

,0,1,2,3
0,NO,YETKÄ°LENDÄ°RME GRUP NO,Ä°L,KURUM
1,1,1,ADANA,ADANA Ä°L SAÄžLIK MÃœDÃœRLÃœÄžÃœ HALK SAÄžLIÄžI LABORAT...
2,2,3,ADANA,ADANA ÅžEHÄ°R HASTANESÄ°
3,3,5,ADANA,Ã‡UKUROVA ÃœNÄ°VERSÄ°TESÄ° BALCALI HASTANESÄ°
4,4,5,ADANA,SEYHAN DEVLET HASTANESÄ°
...,...,...,...,...
519,519,2,ZONGULDAK,ZONGULDAK BÃœLENT ECEVÄ°T ÃœNÄ°VERSÄ°TESÄ° TIP FAKÃœL...
520,520,5,ZONGULDAK,ZONGULDAK ATATÃœRK DEVLET HASTANESÄ°
521,521,7,ZONGULDAK-K. EREÄžLÄ°,KARADENÄ°Z EREÄžLÄ° DEVLET HASTANESÄ°
522,522,6,ZONGULDAK-K. EREÄžLÄ°,Ã–ZEL KARADENÄ°Z EREÄžLÄ° ECHOMAR HASTANESÄ°
523,523,8,ZONGULDAK-K. EREÄžLÄ°,Ã–ZEL EREÄžLÄ° ANADOLU HASTANESÄ°

In [61]:
df_covid[1]

IndexError: list index out of range

# https://www.bbc.com/news/world-51235105

In [62]:

url_2 = "https://www.bbc.com/news/world-51235105"

In [65]:
df_covid_world = pd.read_html(url_2)
df_covid_world

[              Country   Deaths  Death rate*  Total Cases  \
 0                  US  1012833        308.6     87030788
 1              Brazil   672033        318.4     32535923
 2               India   525242         38.4     43531650
 3              Russia   373595        258.8     18173480
 4              Mexico   325793        255.4      6093835
 ..                ...      ...          ...          ...
 220        Micronesia        0          0.0           38
 221           Vatican        0          0.0           29
 222  Marshall Islands        0          0.0           18
 223        Antarctica        0          NaN           11
 224      Saint Helena        0          0.0            4

      New Cases  0  10  100  1k  10k  **  Unnamed: 5
 0                                   NaN         NaN
 1                                   NaN         NaN
 2                                   NaN         NaN
 3                                   NaN         NaN
 4                                   NaN         NaN
 ..                                  ...         ...
 220                                 NaN         NaN
 221                                 NaN         NaN
 222                                 NaN         NaN
 223                                 NaN         NaN
 224                                 NaN         NaN

 [225 rows x 6 columns],
                                          Location  Percent fully vaccinated  \
 0                                           World                      61.0
 1                                           China                      87.0
 2                                           India                      66.0
 3                                              US                      67.0
 4                                          Brazil                      79.0
 ..                                            ...                       ...
 212                British Indian Ocean Territory                       0.0
 213                                       Eritrea                       0.0
 214                                   North Korea                       0.0
 215  South Georgia and the South Sandwich Islands                       0.0
 216                                       Vatican                       0.0

      Total doses
 0    12120524547
 1     3403643000
 2     1978918170
 3      596233489
 4      456903089
 ..           ...
 212            0
 213            0
 214            0
 215            0
 216            0

 [217 rows x 3 columns]]

In [66]:
df_covid_world[0]

,Country,Deaths,Death rate*,Total Cases,New Cases 0 10 100 1k 10k **,Unnamed: 5
0,US,1012833,308.6,87030788,NaN,NaN
1,Brazil,672033,318.4,32535923,NaN,NaN
2,India,525242,38.4,43531650,NaN,NaN
3,Russia,373595,258.8,18173480,NaN,NaN
4,Mexico,325793,255.4,6093835,NaN,NaN
...,...,...,...,...,...,...
220,Micronesia,0,0.0,38,NaN,NaN
221,Vatican,0,0.0,29,NaN,NaN
222,Marshall Islands,0,0.0,18,NaN,NaN
223,Antarctica,0,NaN,11,NaN,NaN
224,Saint Helena,0,0.0,4,NaN,NaN

In [68]:
df_covid_world[0].to_csv("covid_data.csv")

## SQL Connection

In [69]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\user\anaconda3\lib\site-packages (1.4.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\user\anaconda3\lib\site-packages (from sqlalchemy) (1.1.1)

In [70]:
from sqlalchemy import create_engine

https://en.wikipedia.org/wiki/World_population

In [71]:
temp_db = create_engine("sqlite:///:memory:")

In [72]:
temp_db.table_names()

[]

In [74]:
html_table = pd.read_html("https://en.wikipedia.org/wiki/World_population")

In [76]:
html_table[7]

   Rank         Country  Population  Area(km2)  Density(pop/km2)
0     1       Singapore     5921231        719              8235
1     2      Bangladesh   165650475     148460              1116
2     3  Palestine[103]     5223000       6025               867
3     4          Taiwan    23580712      35980               655
4     5     South Korea    51844834      99720               520
5     6         Lebanon     5296814      10400               509
6     7          Rwanda    13173730      26338               500
7     8         Burundi    12696478      27830               456
8     9           India  1389637446    3287263               423
9    10     Netherlands    17400824      41543               419

In [78]:
html_table[7].to_sql(name ="world_population", con=temp_db)

10

In [80]:
temp_db.table_names()

['world_population']

In [81]:
pd.read_sql_query(sql="SELECT Country, Population FROM world_population", con=temp_db)

          Country  Population
0       Singapore     5921231
1      Bangladesh   165650475
2  Palestine[103]     5223000
3          Taiwan    23580712
4     South Korea    51844834
5         Lebanon     5296814
6          Rwanda    13173730
7         Burundi    12696478
8           India  1389637446
9     Netherlands    17400824

In [82]:
df_sql[["Country", "Population"]]

NameError: name 'df_sql' is not defined